2018/os-exception.html
<!DOCTYPE html>
<html lang="zh-CN">
<head>
<!-- 2019-10-31 四 11:27 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>操作系统之异常控制流</title>
<meta name="generator" content="Org mode">
<meta name="author" content="rgb-24bit">
<link rel="stylesheet" type="text/css" href="https://rgb-24bit.github.io/blog/misc/style.css">
<!-- Global site tag (gtag.js) - Google Analytics -->
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://rgb-24bit.github.io/blog/"> UP </a>
 |
 <a accesskey="H" href="https://rgb-24bit.github.io"> HOME </a>
</div><div id="content">
<h1 class="title">操作系统之异常控制流</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9653799">1. 简介</a></li>
<li><a href="#orge5facc4">2. 异常控制流</a></li>
<li><a href="#orgd8dd1bb">3. 异常</a></li>
<li><a href="#org38e88d3">4. 信号</a></li>
<li><a href="#org2d4771d">5. 非本地跳转</a></li>
<li><a href="#org10b4609">6. 参考链接</a></li>
</ul>
</div>
</div>

<div id="outline-container-org9653799" class="outline-2">
<h2 id="org9653799"><span class="section-number-2">1</span> 简介</h2>
<div class="outline-text-2" id="text-1">
<p>
<code>CSAPP</code> - 深入理解计算机系统这本书断断续续的看了部分章节了， 但是在看到 <b>异常控制流</b> 这一章之前，我没有想到 <b>操作系统</b> 在我们编写的程序中扮演着如此总要的角色。
</p>

<p>
我看这本书的顺序没有按着目录顺序来， 一部分原因是为了适配学校的课程， 一部分是因为兴趣， 毕竟部分内容看着更有趣些。
</p>

<p>
现在看过的章节以及阅读顺序为：
</p>
<ul class="org-ul">
<li>第一章 计算机系统漫游</li>
<li>第二章 信息的表示和处理</li>
<li>第三章 程序的机器级表示</li>
<li>第七章 链接</li>
<li>第十章 系统级 I/O</li>
<li>第八章 异常控制流</li>
</ul>

<p>
第八章是刚看完不久的一个章节， 也是目前感触最深的一个章节。
</p>

<p>
这篇博客的一个目的就是记录下现在的感受。
</p>
</div>
</div>

<div id="outline-container-orge5facc4" class="outline-2">
<h2 id="orge5facc4"><span class="section-number-2">2</span> 异常控制流</h2>
<div class="outline-text-2" id="text-2">
<p>
如果学过其他高级语言， 那么 <b>异常</b> 这个词应该不陌生， 或者说很熟悉。
</p>

<p>
但是在 <b>异常控制流</b> 这一章中， 异常的概念和我之前的理解有着很大的不同， 但是也感觉的出来，书中的描述更符合 <b>计算机</b> 的想法。
</p>

<p>
假设存在一个值的序列： <code>A0, A1, A2, ···, Ak</code>. 其中每个值 <code>Ak</code> 是某个相应的指令 <code>Ik</code> 的地址。
</p>

<p>
每次从 <code>Ak</code> 到 <code>A(k+1)</code> 的过渡称为 <b>控制转移</b>, 这样的 <b>控制转移序列</b> 叫做处理器的 <b>控制流</b>.
</p>

<p>
如果执行顺序相邻的指令在内存中的地址也是相邻的， 那么这样的 <b>控制流</b> 称为 <b>平滑控制流</b>.
</p>

<p>
而 <b>突变</b> 的平滑控制流， 即执行顺序相邻的指令在内存中的地址不相邻， 那么这样的控制流就称为 <b>异常控制流(ECF)</b>.
</p>

<p>
简单的解释就是： <b>异常控制流</b> 就是存在执行顺序上相邻但内存地址上不相邻的指令的 <b>控制流</b>.
</p>
</div>
</div>

<div id="outline-container-orgd8dd1bb" class="outline-2">
<h2 id="orgd8dd1bb"><span class="section-number-2">3</span> 异常</h2>
<div class="outline-text-2" id="text-3">
<p>
<b>异常</b> 是 <b>异常控制流</b> 的一种 <b>表现形式</b>, 也就是说异常就是异常控制流。
</p>

<p>
<b>异常</b> 分为 <b>中断</b>, <b>陷阱</b>, <b>故障</b> 和 <b>终止</b>.
</p>

<p>
假设处理器正在执行某个应用程序的某条指令 <code>I_curr</code>, 该指令的下一条指令为 <code>I_next</code>.
</p>

<dl class="org-dl">
<dt>中断</dt><dd><p>
中断是由处理器外部的 <code>I/O</code> 设备引起的， 与指令的执行无关， 因此是 <b>异步的</b>. 这是唯一的 <b>异步</b> 异常，而处理 <b>中断</b> 的异常处理程序为 <b>中断处理程序</b>.
</p>

<p>
如果执行 <code>I_curr</code> 指令时发生中断异常， 那么处理器会在执行完 <code>I_curr</code> 指令后调用 <b>中断处理程序</b>, 此时控制流发生了突变， 因为 <b>中断处理程序</b> 的指令和当前程序的指令在内存上不相邻。
</p>

<p>
在执行完 <b>中断处理程序</b> 后， 控制流返回到指令 <code>I_next</code>.
</p></dd>

<dt>陷阱</dt><dd><p>
陷阱是 <b>有意</b> 的异常， 由某一条指令的执行引起。 当引起陷阱的指令 <code>I_curr</code> 执行完后， 系统会调用相应的 <b>陷阱处理程序</b>.
然后控制流返回到指令 <code>I_next</code>.
</p>

<p>
引起 <b>陷阱</b> 的指令通常为一个 <b>系统调用</b>, 系统调用是 <b>内核</b> 为 <b>用户程序</b> 提供的一个像过程（函数）一样的接口。
</p>

<p>
用户程序执行的如 <b>文件读取</b>, <b>进程操作</b> 等动作都是由 <b>内核</b> 提供服务的。
</p></dd>

<dt><b>故障</b></dt><dd><p>
故障是由正在执行的指令 <code>I_curr</code> 引起的， 这条指令可能导致了某个错误。 错误发生后， 处理器会停下当前指令的执行， 调用对应的 <b>故障处理程序</b>.
</p>

<p>
如果 <b>故障处理程序</b> 能够修复这个错误， 那么控制流就返回到停下的指令 <code>I_curr</code> 处。 反之， 终止当前程序。
</p></dd>

<dt>终止</dt><dd>终止是不可恢复的致命错误造成的异常， 发生时会直接终止程序。</dd>
</dl>


<p>
可以看到， 这四种基本的 <b>异常</b> 发生时都会导致 <b>控制流</b> 的突变， 而控制流的突变使得 <b>控制流</b> 转向另外的程序。
</p>
</div>
</div>

<div id="outline-container-org38e88d3" class="outline-2">
<h2 id="org38e88d3"><span class="section-number-2">4</span> 信号</h2>
<div class="outline-text-2" id="text-4">
<p>
在原书上， 信号前还有一节的内容是 <b>进程</b>, <b>进程</b> 属于 <b>异常</b> 的一种应用方式， 需要详细了解的话可以查阅相关资料。
</p>

<p>
相较于 <b>进程</b>, 这一章带给我最大感触的两节就是 <b>异常</b> 和 <b>信号</b>.
</p>

<p>
<b>操作系统</b> 通过修改目标进程的 <b>上下文</b> 来向目标进程发送信号。
</p>

<p>
这里不讨论 <b>信号</b> 的具体表现形式， 只需要知道， 发送信号是通过改变目标进程 <b>上下文</b> 来完成的就足够了。
</p>

<p>
而进程可以通过获取这些变化来获取或处理信号。
</p>

<p>
为什么说这一节带来的感触很大， 因为这是我第一次感受到了 <b>操作系统</b> 和我编写的程序之间的距离。
</p>

<p>
之前的学习过程的章节中， 编写的程序都没有如此直白的和 <b>操作系统</b> 进行交流， 而这一节， 你能够感受到， 你的程序和操作系统
<b>从来没有分开过</b>.
</p>

<p>
当进程收到信号后， 会通过 <b>异常控制流</b> 调用相应的 <b>信号处理程序</b>. 操作系统提供了一些默认的处理行为， 我们可以修改其中的一部分。
</p>

<p>
想要了解相关操作， 可以看一下 <b>标准库</b>: <code>&lt;signal.h&gt;</code>.
</p>
</div>
</div>

<div id="outline-container-org2d4771d" class="outline-2">
<h2 id="org2d4771d"><span class="section-number-2">5</span> 非本地跳转</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">
<pre class="src src-C"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;setjmp.h&gt;</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;signal.h&gt;</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;stdio.h&gt;</span>

<span class="org-type">jmp_buf</span> <span class="org-variable-name">ex_buf__</span>;

<span class="org-preprocessor">#define</span> <span class="org-variable-name">TRY</span> <span class="org-keyword">do</span>{ <span class="org-keyword">if</span>(<span class="org-negation-char">!</span>setjmp(ex_buf__)) {
<span class="org-preprocessor">#define</span> <span class="org-variable-name">CATCH</span> } <span class="org-keyword">else</span> {
<span class="org-preprocessor">#define</span> <span class="org-variable-name">ETRY</span> } } <span class="org-keyword">while</span>(0)
<span class="org-preprocessor">#define</span> <span class="org-variable-name">THROW</span> longjmp(ex_buf__, 1)

<span class="org-type">void</span> <span class="org-function-name">sigint_handler</span>(<span class="org-type">int</span> <span class="org-variable-name">sig</span>) {
  THROW;
}

<span class="org-type">int</span> <span class="org-function-name">main</span>(<span class="org-type">void</span>) {
  <span class="org-keyword">if</span> (signal(SIGINT, sigint_handler) == SIG_ERR) {
    <span class="org-keyword">return</span> 0;
  }

  TRY {
    raise(SIGINT);
  } CATCH {
    printf(<span class="org-string">"KeyboardInterrupt"</span>);
  }
  ETRY;

  <span class="org-keyword">return</span> 0;
}
</pre>
</div>

<p>
上面这一段代码尝试在 <code>C</code> 语言中实现 <code>try/catch</code> 语句， 用到了 <b>信号</b> 和 <b>非本地跳转</b> 相关的内容。
</p>

<p>
首先是 <b>信号</b> 相关的内容：
</p>
<div class="org-src-container">
<pre class="src src-C"><span class="org-type">void</span> <span class="org-function-name">sigint_handler</span>(<span class="org-type">int</span> <span class="org-variable-name">sig</span>);
</pre>
</div>

<p>
这个函数定义了一个 <b>信号处理程序</b>, 这个信号处理程序使用函数 <code>signal</code> 完成注册， 替代了信号 <code>SIGINT</code> 的默认处理程序。
</p>

<p>
<code>SIGINT</code> 代表的是 <code>Ctrl-C</code> 按下时产生的信号。
</p>

<p>
然后语句 <code>raise(SIGINT)</code> 主动发送一个 <code>SIGINT</code> 信号， 使得系统调用 <code>sigint_handler</code>.
</p>

<p>
接下来是 <b>非本地跳转</b> 相关的内容：
</p>
<div class="org-src-container">
<pre class="src src-C"><span class="org-type">jmp_buf</span> <span class="org-variable-name">ex_buf__</span>;
</pre>
</div>

<p>
这个变量用于保存上下文信息， 当调用 <code>setjmp</code> 时， 会将调用时的上下文信息保存到 <code>ex_buf__</code> 中。并返回数值 <code>0</code>.
</p>

<p>
当执行到 <code>longjmp(ex_buf__, 1)</code> 时， 会恢复当前的上下文到 <code>ex_buf__</code> 保存时的状态。
</p>

<p>
当时正在执行的调用是 <code>setjmp</code>, 此时， <code>setjmp</code> 会再次返回一个值， 这个值就是 <code>longjmp</code> 第二个参数指定的值。
</p>

<p>
如果第二个参数的值是 <code>0</code>, 那么 <code>setjmp</code> 会返回 <code>1</code>.
</p>

<p>
宏展开后的主要程序代码为：
</p>
<div class="org-src-container">
<pre class="src src-C"><span class="org-type">jmp_buf</span> <span class="org-variable-name">ex_buf__</span>;

<span class="org-type">void</span> <span class="org-function-name">sigint_handler</span>(<span class="org-type">int</span> <span class="org-variable-name">sig</span>) {
  longjmp(ex_buf__, 1);
}

<span class="org-type">int</span> <span class="org-function-name">main</span>(<span class="org-type">void</span>) {
  <span class="org-keyword">if</span> (signal(2, sigint_handler) == ((<span class="org-type">_crt_signal_t</span>)-1)) {
    <span class="org-keyword">return</span> 0;
  }

  <span class="org-keyword">do</span>{ <span class="org-keyword">if</span>(<span class="org-negation-char">!</span>_setjmp(ex_buf__)) { {
        raise(2);
      } } <span class="org-keyword">else</span> { {
        printf(<span class="org-string">"KeyboardInterrupt"</span>);
      }
    } } <span class="org-keyword">while</span>(0);

  <span class="org-keyword">return</span> 0;
}
</pre>
</div>

<p>
因此， 程序的执行流程为：
</p>
<ul class="org-ul">
<li><code>_setjmp</code> 第一次的返回值为 <code>0</code>, 执行语句 <code>raise(2)</code>.</li>
<li>对应的消息处理程序中执行 <code>longjmp</code>, 使得程序再次跳转到执行 <code>_setjmp</code> 处</li>
<li>此时 <code>_setjmp</code> 返回的值为 <code>1</code>, 因此程序会输出 <code>KeyboardInterrupt</code>.</li>
</ul>

<p>
可以由此猜测高级语言的 <b>异常机制</b> 的实现。
</p>

<p>
<b>猜测：</b> 高级语言抛出异常时， 执行一次非本地跳转， 然后判断该次非本地跳转的返回值以执行相应的 <b>catch</b> 块。
</p>

<p>
同时注册 <b>信号处理程序</b> 用于捕获如键盘中断的信号， 并转换为内置的异常抛出。
</p>
</div>
</div>

<div id="outline-container-org10b4609" class="outline-2">
<h2 id="org10b4609"><span class="section-number-2">6</span> 参考链接</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li><a href="http://www.di.unipi.it/~nids/docs/longjump_try_trow_catch.html">Exceptions in C with Longjmp and Setjmp</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
版权声明：本作品采用<a rel="license" href="http://creativecommons.org/licenses/by-nc/4.0/">知识共享署名-非商业性使用 4.0 国际许可协议</a>进行许可
<div id="disqus_thread"></div>
<script type="text/javascript">
  var disqus_shortname = 'rgb-24bit';
  (function() {
    var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
    dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
    (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
  })();
</script>
</div>
</body>
</html>
